; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=35, remove_proportion=0.2, bases=7, instance_id=20, output=./training, seed=61

(define (problem warehouse-20)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 - box
        base1 base2 base3 base4 base5 base6 base7 - base
    )
    (:init
        (to-remove box10)
        (to-remove box11)
        (to-remove box12)
        (to-remove box14)
        (to-remove box21)
        (to-remove box26)
        (to-remove box32)
        (clear box2)
        (on box2 box16)
        (on box16 box20)
        (on box20 box13)
        (on box13 box6)
        (on-base box6 base1)
        (clear box24)
        (on box24 box23)
        (on box23 box10)
        (on box10 box18)
        (on-base box18 base2)
        (clear box9)
        (on box9 box5)
        (on box5 box31)
        (on box31 box28)
        (on box28 box19)
        (on box19 box35)
        (on box35 box11)
        (on box11 box27)
        (on box27 box33)
        (on box33 box4)
        (on-base box4 base3)
        (clear box8)
        (on box8 box26)
        (on box26 box32)
        (on box32 box7)
        (on box7 box21)
        (on box21 box3)
        (on-base box3 base4)
        (clear box14)
        (on box14 box34)
        (on-base box34 base5)
        (clear box12)
        (on box12 box15)
        (on box15 box25)
        (on box25 box17)
        (on box17 box1)
        (on box1 box29)
        (on-base box29 base6)
        (clear box22)
        (on box22 box30)
        (on-base box30 base7)
    )
    (:goal (and 
        (removed box10)
        (removed box11)
        (removed box12)
        (removed box14)
        (removed box21)
        (removed box26)
        (removed box32)
    ))
)

; plan
1. (remove box12 box15)
   deleted: (on box12 box15) (clear box12)
   added: (removed box12) (clear box15)
   goals met: 1 of 7
2. (remove box14 box34)
   deleted: (on box14 box34) (clear box14)
   added: (removed box14) (clear box34)
   goals met: 2 of 7
3. (move box24 box23 box15)
   deleted: (clear box15) (on box24 box23)
   added: (on box24 box15) (clear box23)
   goals met: 2 of 7
4. (move box23 box10 box2)
   deleted: (clear box2) (on box23 box10)
   added: (on box23 box2) (clear box10)
   goals met: 2 of 7
5. (remove box10 box18)
   deleted: (on box10 box18) (clear box10)
   added: (removed box10) (clear box18)
   goals met: 3 of 7
6. (move box8 box26 box18)
   deleted: (clear box18) (on box8 box26)
   added: (on box8 box18) (clear box26)
   goals met: 3 of 7
7. (move box9 box5 box22)
   deleted: (clear box22) (on box9 box5)
   added: (on box9 box22) (clear box5)
   goals met: 3 of 7
8. (move box5 box31 box23)
   deleted: (clear box23) (on box5 box31)
   added: (on box5 box23) (clear box31)
   goals met: 3 of 7
9. (move box31 box28 box24)
   deleted: (clear box24) (on box31 box28)
   added: (on box31 box24) (clear box28)
   goals met: 3 of 7
10. (remove box26 box32)
   deleted: (on box26 box32) (clear box26)
   added: (removed box26) (clear box32)
   goals met: 4 of 7
11. (move box28 box19 box31)
   deleted: (clear box31) (on box28 box19)
   added: (on box28 box31) (clear box19)
   goals met: 4 of 7
12. (move box19 box35 box28)
   deleted: (clear box28) (on box19 box35)
   added: (on box19 box28) (clear box35)
   goals met: 4 of 7
13. (move box35 box11 box19)
   deleted: (clear box19) (on box35 box11)
   added: (on box35 box19) (clear box11)
   goals met: 4 of 7
14. (remove box11 box27)
   deleted: (on box11 box27) (clear box11)
   added: (removed box11) (clear box27)
   goals met: 5 of 7
15. (remove box32 box7)
   deleted: (on box32 box7) (clear box32)
   added: (removed box32) (clear box7)
   goals met: 6 of 7
16. (move box7 box21 box27)
   deleted: (clear box27) (on box7 box21)
   added: (on box7 box27) (clear box21)
   goals met: 6 of 7
17. (remove box21 box3)
   deleted: (on box21 box3) (clear box21)
   added: (removed box21) (clear box3)
   goals met: 7 of 7
